4.5/competitions_app/app/controllers/competitions_controller.rb

  def index
    @competitions = Competition.all
---
SELECT "competitions".* FROM "competitions"

  def create
    @competition = Competition.new(competition_params)
    if @competition.save
---
INSERT INTO "competitions" ("name", "created_at", "updated_at") VALUES ('Tournament', '2025-05-11 18:18:06.159959', '2025-05-11 18:18:06.159959') RETURNING "id"

  def set_competition
    @competition = Competition.find(params[:id])
---
SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = 1 LIMIT 1